---
kind: type
id: T:Autodesk.Revit.DB.ProfileFamilyUsage
source: html/16e9b7c3-f2bd-cdd5-ac71-04a1d4b5a6c4.htm
---
# Autodesk.Revit.DB.ProfileFamilyUsage

An enumerated type listing all types of profile families.

## Syntax (C#)
```csharp
public enum ProfileFamilyUsage
```